---
kind: other
id: Properties.T:Autodesk.Revit.DB.ValueAtPointBase
source: html/4e1ddd33-c260-7fd1-e0eb-6983b6cba0cb.htm
---
# ValueAtPointBase Properties

Specifies whether the .NET object represents a valid Revit entity.